scripts/load-test.yml
config:
  target: http://localhost:8089
  http:
    timeout: 30
    retries: 2  # most twice when failed
  phases:
    # - duration: 60    
    #   arrivalRate: 1     # requests per sec
    #   rampTo: 5
    #   name: Warm up phase
    - duration: 60
      arrivalRate: 5
      rampTo: 10
      name: Ramp up load
    - duration: 30
      arrivalRate: 10
      rampTo: 30
      name: Spike phase

various:
  ids: [1, 2, 3, 4]

scenarios:
  # - name: "Admin User CRUD"
  #   flow:
  #     - get:
  #         url: "/user/getAll"
  #         capture:
  #           - json: "$.user[*].id"
  #             as: "user_ids"
  #     - get:
  #         url: "/user/add/{{ users_ids[$randomInt(0, users_ids.length)] }}"  
      # - post:
      #     url: "/user/update/{{ users_ids[$randomInt(0, users_ids.length)] }}"
      #     json:
      #       name: "New User"
      #       email: "newuser@example.com"
      # - delete:
      #   url: "/user/delete/{{ users_ids[$randomInt(0, users_ids.length)] }}" 
      #   json:
      #     username: "user"
      #     passowrd: "pwd"

  - name: "User Ingredients CRUD"
    flow:
      - get:
          # url: "/ingredient/getAll/{{ user_ids[$randomInt(0, user_ids.length)] }}"
          url: "/ingredient/getAll/{{ various.ids[$randomInt(0, 4)] }}"
          capture:
            - json: "$.item[*].id"
              as: "item_ids"
      # - get:
      #     url: "/ingredient/add/{{ items_ids[$randomInt(0, items_ids.length)] }}"  
      # - post:
      #     url: "/ingredient/update/{{ items_ids[$randomInt(0, items_ids.length)] }}"
      # - delete:
      #     url: "/ingredient/delete/{{ items_ids[$randomInt(0, items_ids.length)] }}"   


  # - name: "User Recipes CRUD"
  #   flow:
  #     - get:  # get all recipe
  #         url: "/recipe"
  #         capture:
  #           - json: "$.recipes[*].id"
  #             as: "recipes_ids"
      # - get:  # get recipe by id
      #   url: "/recipe/{{ recipes_ids[$randomInt(0, recipes_ids.length)] }}"

      # - get:  # get all published recipe
      #     url: "/recipe/published"
      # - post:   # add new recipe
      #     url: "/recipe"
      #     json:
      #       name: "Tomato Soup"
      #       ingredients:
      #         - name: "Tomato"
      #           quantity: 2   

      # - get:  # search recipe by name
      #     url: "/recipe/search?name={recipeName}"  
      # - get:  # get recipe by user
      #     url: "/recipe/creator/{{ users_ids[$randomInt(0, users_ids.length)] }}"
          
      # - put:
      #     url: "/recipe/{{ recipes_ids[$randomInt(0, recipes_ids.length)] }}"            
      #     json:
      #       name: "Tomato Soup"
      #       ingredients:
      #         - name: "Tomato"
      #           quantity: 3  
      # - delete:
      #     url: "/recipe/{{ recipes_ids[$randomInt(0, recipes_ids.length)] }}"